# 인공지능개론 1, 2주차 내용

#### 유비쿼터스 구현
>오래전에 나온 유비쿼터스는 연결된 기기마다 기기 스스로 문제를 해결 할 기술이 없었음 -> 인공지능의 발전으로 구현이 가능해짐

#### 협력시대
>현재, 미래에는 인공지능을 적극 활용하여 사람이 할 수 없는 일이나, 사람을 도와주는 방식으려 사람과 인공지능이 협력하는 시대

#### 인공지능의 성공
- 정보화 시대로 데이터의 양이 증가
- 컴퓨터 파워 증가
- 정보(알고리즘)의 공유로 인해 인공지능의 발전 속도 증

## 기호 주의
- 마빈 민키스 - 모든 지식을 기호화 하여 기계에 학습을 시킴.
#### 전문가 시스템(Expert System)
- 전문가의 노하우, 지식 등을 기호화 하여 학습을 시킨다.

>논리로 구성되어 결과 도출
>한계가 있으며, 당시에는 데이터 또한 부족함

## 연결 주의
- 프랭크 로젠블릿 - 사람의 뇌를 모방하여 인공지능을 개발 (딥러닝)
- 퍼셉트론 : 초기형태 인공 신경망 모델


기호주의 > 머신러닝(통계) > ANN > 딥러닝
기호주의와 머신러닝은 결국 사람이 알고리즘을 작성하고 통제해야 한다.

#### 기호주의와 자연어 처리
- 자연어에 대한 구조와 문법 수많은 학습해야 하며 (구문 분석 문제)
- 다른 의미로 사용하거나 비유적인 문법에 대해서 결과를 도출할 수 없음 (의미 분석 문제)

#### 통계를 이용한 자연어 처리
- 통계와 확률을 이용하여 더 자연스러운 번역과 작문이 가능





### 인공지능과 데이터 사이언스의 차이
데이터 사용 목적에 차이가 있다
데이터 사이언스 -> 데이터 자체로 분석하여 유의미한 결과를 도출
인공지능 -> 데이터를 이용한 학습을 통해 좋은 인공지능 모델을 만들어냄






















